ТОИР_демо/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/торо_РабочееМестоТехническогоСпециалиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_РабочееМестоТехническогоСпециалиста</name>
  <attributes>
    <name>ВидДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершенные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Перезаполнить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроведенные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПоНаработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеОбновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ТОИР_демо/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Если Параметры.Свойство("ТаблицаКритичности") Тогда
		ТаблицаКритичности.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТаблицаКритичности));
		ИспользоватьВыделениеПо = "По критичности";
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоКритичности;
	ИначеЕсли Параметры.Свойство("ТаблицаПриоритетностиОР") Тогда
		ТаблицаПриоритетностиОР.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТаблицаПриоритетностиОР));
		ИспользоватьВыделениеПо = "По приоритету объекта ремонта";
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоПриоритетуОР;
	ИначеЕсли Параметры.Свойство("ТаблицаНаработки") Тогда
		ТаблицаНаработки.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ТаблицаНаработки));
		ИспользоватьВыделениеПо = "По наработке объекта ремонта";
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоНаработке;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КритичностьДефекта.Ссылка КАК Критичность
	|ИЗ
	|	Справочник.торо_КритичностьДефекта КАК торо_КритичностьДефекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_КритичностьДефекта.Код";
	
	ЦветПоУмолчанию = Новый Цвет(255,255,255);
	
	Если ТаблицаКритичности.Количество() = 0 Тогда
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Цвет"));
		РезультатЗапроса.Колонки.Добавить("Цвет",Новый ОписаниеТипов(Массив));
		
		РезультатЗапроса.ЗаполнитьЗначения(ЦветПоУмолчанию,"Цвет");
		
		ТаблицаКритичности.Загрузить(РезультатЗапроса);
		
	Иначе 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если ТаблицаКритичности.НайтиСтроки(Новый Структура("Критичность", Выборка.Критичность)).Количество() = 0 Тогда
				Нс = ТаблицаКритичности.Добавить();
				Нс.Критичность = Выборка.Критичность;
				Нс.Цвет = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПриоритетыОбъектовРемонта.Ссылка КАК Приоритет
	|ИЗ
	|	Справочник.торо_ПриоритетыОбъектовРемонта КАК торо_ПриоритетыОбъектовРемонта
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ПриоритетыОбъектовРемонта.Код";
	
	ЦветПоУмолчанию = Новый Цвет(255,255,255);
	
	Если ТаблицаПриоритетностиОР.Количество() = 0 Тогда
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Цвет"));
		РезультатЗапроса.Колонки.Добавить("Цвет",Новый ОписаниеТипов(Массив));
		
		РезультатЗапроса.ЗаполнитьЗначения(ЦветПоУмолчанию,"Цвет");
		
		ТаблицаПриоритетностиОР.Загрузить(РезультатЗапроса);
		
	Иначе 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если ТаблицаПриоритетностиОР.НайтиСтроки(Новый Структура("Приоритет", Выборка.Приоритет)).Количество() = 0 Тогда
				Нс = ТаблицаПриоритетностиОР.Добавить();
				Нс.Приоритет = Выборка.Приоритет;
				Нс.Цвет = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТаблицаНаработки.Количество() = 0 Тогда
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Недоработка более 25%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Недоработка от 15% до 25%";
		НС.Цвет = ЦветПоУмолчанию;

		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Недоработка менее 15%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Переработка менее 15%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Переработка от 15% до 25%";
		НС.Цвет = ЦветПоУмолчанию;
		
		НС = ТаблицаНаработки.Добавить();
		НС.Наработка = "Переработка более 25%";
		НС.Цвет = ЦветПоУмолчанию;

	КонецЕсли;

	Если Объект.ПериодОбновления = 0 Тогда
	
		Объект.ПериодОбновления = 180;
	
	КонецЕсли;
	
	Элементы.ИспользоватьВыделениеПо.СписокВыбора.Вставить(0,"По критичности","По критичности");
	Элементы.ИспользоватьВыделениеПо.СписокВыбора.Вставить(1,"По приоритету объекта ремонта","По приоритету объекта ремонта");
	ИспользоватьВыделениеПо = ?(ЗначениеЗаполнено(ИспользоватьВыделениеПо), ИспользоватьВыделениеПо, "По критичности");
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИспользоватьВыделениеПоОбработкаВыбора(Элементы.ИспользоватьВыделениеПо, ИспользоватьВыделениеПо, Истина);
	фВидДаты = Объект.ВидДаты;
	Элементы.ДатаАктуальности.Доступность = (фВидДаты = 1);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьВыделениеПоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = "По критичности" Тогда
		
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоКритичности;
		
	ИначеЕсли ВыбранноеЗначение = "По приоритету объекта ремонта" Тогда
		
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоПриоритетуОР;
		
	ИначеЕсли ВыбранноеЗначение = "По наработке объекта ремонта" Тогда
		
		Элементы.ПанельУстановкаПалитры.ТекущаяСтраница = Элементы.ПанельУстановкаПалитры.ПодчиненныеЭлементы.ПалитраПоНаработке;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВыделениеПоПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаДатыПриИзменении(Элемент)
	
	флДатаАктуальности = (фВидДаты = 1);
	Если НЕ флДатаАктуальности Тогда
		Объект.ДатаАктуальности = ТекущаяДата();
	КонецЕсли;
	Элементы.ДатаАктуальности.Доступность = флДатаАктуальности;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКритичности
&НаКлиенте
Процедура ТаблицаКритичностиЦветПриИзменении(Элемент)
	
	УстановитьУсловноеОформление()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Применить(Команда)
	
	
	
	СтруктураПараметров = Новый Структура("ВидДаты, ДатаАктуальности, Завершенные, ДанныеПоНаработке, НеПроведенные, ПериодОбновления, АвтоматическоеОбновление, ПлановыйПериод, Периодичность, РежимВыделенияСтрок",
	фВидДаты, Объект.ДатаАктуальности, Объект.Завершенные, Объект.ДанныеПоНаработке, Объект.НеПроведенные, Объект.ПериодОбновления, Объект.АвтоматическоеОбновление, Объект.ПлановыйПериод, Объект.Периодичность, ИспользоватьВыделениеПо);
	
	Если ИспользоватьВыделениеПо = "По критичности" Тогда
		ВладелецФормы.ТаблицаКритичности.Очистить();
		Для каждого Стр Из ТаблицаКритичности Цикл
			НС = ВладелецФормы.ТаблицаКритичности.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	ИначеЕсли ИспользоватьВыделениеПо = "По приоритету объекта ремонта" Тогда
		ВладелецФормы.ТаблицаПриоритетностиОР.Очистить();
		Для каждого Стр Из ТаблицаПриоритетностиОР Цикл
			НС = ВладелецФормы.ТаблицаПриоритетностиОР.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	ИначеЕсли ИспользоватьВыделениеПо = "По наработке объекта ремонта" Тогда
		ВладелецФормы.ТаблицаНаработки.Очистить();
		Для каждого Стр Из ТаблицаНаработки Цикл
			НС = ВладелецФормы.ТаблицаНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЦикла;
	КонецЕсли;
	
	Оповестить("ПерезаполнитьТаблицы", СтруктураПараметров); 
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Если ИспользоватьВыделениеПо = "По критичности" Тогда
		Для каждого Стр Из ТаблицаКритичности Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаКритичностиЦвет");
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаКритичности.Критичность");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Критичность;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
	ИначеЕсли ИспользоватьВыделениеПо = "По приоритету объекта ремонта" Тогда
		
		Для каждого Стр Из ТаблицаПриоритетностиОР Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаПриоритетностиОРЦвет");
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПриоритетностиОР.Приоритет");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Приоритет;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	ИначеЕсли ИспользоватьВыделениеПо = "По наработке объекта ремонта" Тогда
		
		Для каждого Стр Из ТаблицаНаработки Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНаработкиЦвет");
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаНаработки.Отклонение");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Наработка;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
